ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_pdm_pcm_v2.h
#include "cy_device.h"

#if defined (CY_IP_MXPDM)

#include "cy_syslib.h"
#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>

#ifdef __cplusplus
extern "C"
{
#endif

/******************************************************************************
 * Global definitions
 ******************************************************************************/

/* Macros */
/**
* \addtogroup group_pdm_pcm_macros_v2
* \{
*/

/** The driver major version */
#define CY_PDM_PCM_DRV_VERSION_MAJOR       1

/** The driver minor version */
#define CY_PDM_PCM_DRV_VERSION_MINOR       0

/** The PDM-PCM driver identifier */
#define CY_PDM_PCM_ID                       CY_PDL_DRV_ID(0x26u)

/**
* \defgroup group_pdm_pcm_macros_interrupt_masks_v2 Interrupt Masks
* \{
*/

/** More entries in the RX FIFO than specified by Trigger Level. */
#define CY_PDM_PCM_INTR_RX_TRIGGER         (PDM_CH_INTR_RX_FIFO_TRIGGER_Msk)
/** Attempt to write to a full RX FIFO. */
#define CY_PDM_PCM_INTR_RX_OVERFLOW       (PDM_CH_INTR_RX_FIFO_OVERFLOW_Msk)
/**  Attempt to read from an empty RX FIFO. */
#define CY_PDM_PCM_INTR_RX_UNDERFLOW        (PDM_CH_INTR_RX_FIFO_UNDERFLOW_Msk)
/** CIC filter PCM samples are produced at a faster rate than the FIR filter can process them */
#define CY_PDM_PCM_INTR_RX_FIR_OVERFLOW       (PDM_CH_INTR_RX_FIR_OVERFLOW_Msk)
/** when PDM samples are generated too fast */
#define CY_PDM_PCM_INTR_RX_IF_OVERFLOW       (PDM_CH_INTR_RX_IF_OVERFLOW_Msk)

/** \} group_pdm_pcm_macros_interrupt_masks_v2 */

/** \} group_pdm_pcm_macros_v2 */

/**
* \addtogroup group_pdm_pcm_enums_v2
* \{
*/

/** PDM Word Length. */
typedef enum
{
    CY_PDM_PCM_WSIZE_8_BIT      = 0U,         /**< Word length: 8 bit.  */
    CY_PDM_PCM_WSIZE_10_BIT     = 1U,         /**< Word length: 10 bit. */
    CY_PDM_PCM_WSIZE_12_BIT     = 2U,         /**< Word length: 12 bit. */
    CY_PDM_PCM_WSIZE_14_BIT     = 3U,         /**< Word length: 14 bit. */
    CY_PDM_PCM_WSIZE_16_BIT     = 4U,         /**< Word length: 16 bit. */
    CY_PDM_PCM_WSIZE_18_BIT     = 5U,         /**< Word length: 18 bit. */
    CY_PDM_PCM_WSIZE_20_BIT     = 6U,         /**< Word length: 20 bit. */
    CY_PDM_PCM_WSIZE_24_BIT     = 7U,         /**< Word length: 24 bit. */
    CY_PDM_PCM_WSIZE_32_BIT     = 8U          /**< Word length: 32 bit. */
} cy_en_pdm_pcm_word_size_t;

/** cy_en_pdm_pcm_clock_sel_t. */
typedef enum
{
    CY_PDM_PCM_SEL_SRSS_CLOCK   = 0U,         /* Interface clock is selected as clk_if_srss[0]. */
    CY_PDM_PCM_SEL_PDM_DATA0    = 1U,         /* Interface clock is selected as pdm_data[0]. */
    CY_PDM_PCM_SEL_PDM_DATA1    = 2U,         /* Interface clock is selected as pdm_data[1]. */
    CY_PDM_PCM_SEL_OFF          = 3U         /* Interface clock clk_if is off. */
} cy_en_pdm_pcm_clock_sel_t;

/** PDM Halve Rate Sampling. */
typedef enum
{
    CY_PDM_PCM_RATE_FULL       = 0U,         /**< Channel full. */
    CY_PDM_PCM_RATE_HALVE      = 1U          /**< Channel halve. */
} cy_en_pdm_pcm_halve_rate_sel_t;

/** CIC DECIM CODE. */
typedef enum
{
    CY_PDM_PCM_CHAN_CIC_DECIM_2   = 0U,         /**< CIC Filter PCM Frequency is 1/2 * PDM Frequency. */
    CY_PDM_PCM_CHAN_CIC_DECIM_4   = 1U,         /**< CIC Filter PCM Frequency is 1/4 * PDM Frequency. */
    CY_PDM_PCM_CHAN_CIC_DECIM_8   = 2U,         /**< CIC Filter PCM Frequency is 1/8 * PDM Frequency. */
    CY_PDM_PCM_CHAN_CIC_DECIM_16  = 3U,         /**< CIC Filter PCM Frequency is 1/16 * PDM Frequency. */
    CY_PDM_PCM_CHAN_CIC_DECIM_32  = 4U          /**< CIC Filter PCM Frequency is 1/32 * PDM Frequency. */
} cy_en_pdm_pcm_ch_cic_decimcode_t;

/** FIR0 DECIM CODE. */
typedef enum
{
    CY_PDM_PCM_CHAN_FIR0_DECIM_1  = 0U,         /**< FIR0 Filter PCM Frequency is 1/1 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR0_DECIM_2  = 1U,         /**< FIR0 Filter PCM Frequency is 1/2 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR0_DECIM_3  = 2U,         /**< FIR0 Filter PCM Frequency is 1/3 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR0_DECIM_4  = 3U,         /**< FIR0 Filter PCM Frequency is 1/4 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR0_DECIM_5  = 4U          /**< FIR0 Filter PCM Frequency is 1/5 * PCM Frequency. */
} cy_en_pdm_pcm_ch_fir0_decimcode_t;

/** FIR1 DECIM CODE. */
typedef enum
{
    CY_PDM_PCM_CHAN_FIR1_DECIM_1   = 0U,         /**< FIR1 Filter PCM Frequency is 1/1 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR1_DECIM_2   = 1U,         /**< FIR1 Filter PCM Frequency is 1/2 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR1_DECIM_3   = 2U,         /**< FIR1 Filter PCM Frequency is 1/3 * PCM Frequency. */
    CY_PDM_PCM_CHAN_FIR1_DECIM_4   = 3U,         /**< FIR1 Filter PCM Frequency is 1/4 * PCM Frequency. */
} cy_en_pdm_pcm_ch_fir1_decimcode_t;

/** DC Block CODE. */
typedef enum
{
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_1   = 0U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-0)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_2   = 1U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-1)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_4   = 2U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-2)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_8   = 3U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-3)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_16  = 4U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-4)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_32  = 5U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-5)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_64  = 6U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-6)). */
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_128 = 7U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-7)). */
} cy_en_pdm_pcm_ch_dcblock_coef_t;

/** \cond INTERNAL */
/** PDM Output Mode. */
typedef enum
{
    CY_PDM_PCM_OUT_CHAN_LEFT   = 1U,         /**< Channel mono left. */
    CY_PDM_PCM_OUT_CHAN_RIGHT  = 2U,         /**< Channel mono right. */
    CY_PDM_PCM_OUT_STEREO      = 3U          /**< Channel stereo. */
} cy_en_pdm_pcm_out_t;
/** \endcond */

/** \cond INTERNAL */
/** The PDM-PCM status codes. */
typedef enum
{
    CY_PDM_PCM_SUCCESS         = 0x00UL,    /**< Success status code */
    CY_PDM_PCM_BAD_PARAM       = CY_PDM_PCM_ID | CY_PDL_STATUS_ERROR |0x01UL     /**< Bad parameter status code */
} cy_en_pdm_pcm_status_t;
/** \endcond */

