ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_pdm_pcm_v2.h
/** \} group_pdm_pcm_enums_v2 */


/**
* \addtogroup group_pdm_pcm_data_structures_v2
* \{
*/

/******************************************************************************
 * Global type definitions
 ******************************************************************************/
 
 /** PDM-PCM Test Mode configuration */
 typedef struct
 {
     uint8_t drive_delay_hi;                /**< Interface drive delay on the low phase of the PDM interface clock. 
                                             This field specifies when a PDM value is driven expressed in clk_if clock cycles. 
                                             DRIVE_DELAY should be set in the range [0, IF_CTL.CLOCK_DIV]:
                                            "0": Drive PDM value 1 clk_if cycle after the rising edge of clk_pdm.
                                            "1": Drive PDM value 2 clk_if cycles after the rising edge of clk_pdm.
                                            ...
                                            "255": Drive PDM value 256 clk_if cycles after the rising edge of clk_pdm. */
     uint8_t drive_delay_lo;                /**< Interface drive delay on the low phase of the PDM interface clock. 
                                             This field specifies when a PDM value is driven expressed in clk_if clock cycles. 
                                             DRIVE_DELAY should be set in the range [0, IF_CTL.CLOCK_DIV]:
                                            "0": Drive PDM value 1 clk_if cycle after the rising edge of clk_pdm.
                                            "1": Drive PDM value 2 clk_if cycles after the rising edge of clk_pdm.
                                            ...
                                            "255": Drive PDM value 256 clk_if cycles after the rising edge of clk_pdm. */
     uint8_t mode_hi;                        /**< Pattern generator mode on the low phase of the PDM interface clock. 
                                            This field specifies the type of pattern driven by the generator:
                                            "0": constant 0's
                                            "1": constant 1's
                                            "2": alternating 0's and 1's (clock pattern)
                                            "3": sine wave */
     uint8_t mode_lo;                        /**< Pattern generator mode on the low phase of the PDM interface clock. 
                                            This field specifies the type of pattern driven by the generator:
                                            "0": constant 0's
                                            "1": constant 1's
                                            "2": alternating 0's and 1's (clock pattern)
                                            "3": sine wave */
     uint8_t audio_freq_div;                /**< Frequency division factor (legal range [3, 13]) to obtain audio frequency
                                            from the PDM clock frequency. This field determines the frequency of the sine wave 
                                            generated by the pattern generator when MODE=3. The formula is below:
                                            Sine wave Frequency = PDM clock frequency / 2p*2^(AUDIO_FREQ_DIV) */
     bool    enable;            /**<  enable.    */
     
     
 }cy_stc_test_config_t;
 
 /** PDM-PCM fir coeff_data structure */
 typedef struct
 {
     
    int16_t         coeff_data0;            /**<  The (symmetric) 30-taps finite impulse response (FIR) filter with 14-bit signed coefficients
                                            (in the range [-8192, 8191]) are specified by FIR0_COEFF0, ..., FIR0_COEFF7.
                                            The FIR filter coefficients have no default values: 
                                            the coefficients MUST be programmed BEFORE the filter is enabled.    */    
    int16_t         coeff_data1;            /**<  coeff_data1.    */
 }cy_stc_pdm_pcm_fir_coeff_t;
 
 /** PDM-PCM Channel initialization configuration */
 typedef struct
 {
    uint8_t                                sampledelay;    /**< Interface sample delay. This field specifies when a PDM value is captured, 
                                                             expressed in clk_if clock cycles.SAMPLE_DELAY should be set in the range [0, IF_CTL.CLOCK_DIV].*/

    cy_en_pdm_pcm_word_size_t             wordSize;       /**< see #cy_en_pdm_pcm_word_size_t */
    bool                                 signExtension;  /**< Word extension type:
                                                        - 0: extension by zero
                                                        - 1: extension by sign bits */
                                                        
    uint8_t                              rxFifoTriggerLevel;  /**< Fifo interrupt trigger level (in words), 
                                                        range: 0 - 63  */
                                                        
    bool                                fir0_enable;    /**< FIR 0 filter coefficient enable (does NOT effect FIR filter scaling and FIR filter decimation):
                                                            '0': Disabled. The middle FIR filter coefficient (16th coefficient, or tap 15 in [0:29] range) is "1" and 
                                                            all other FIR filter coefficients are "0"; i.e. the FIR filter is a pass through filter and the filter gain is "1".
                                                            fir0_pcm[44:0] = cic_pcm[25:0] (with sign extension)'1': Enabled.
                                                            This filter is disabled by default, and typically only used for sample frequencies (Fs) of 8 and 16 kHz. */

                                                            
    cy_en_pdm_pcm_ch_cic_decimcode_t     cic_decim_code; /**< CIC filter decimation. The CIC filter PCM frequency is a fraction of the PDM frequency:
                                                            "0": CIC filter PCM frequency is 1/2 * PDM frequency. CIC PCM values are in the range [-0x10, 0x10].
                                                            "1": CIC filter PCM frequency is 1/4 * PDM frequency. CIC PCM values are in the range [-0x200, 0x200].
                                                            "2": CIC filter PCM frequency is 1/8 * PDM frequency. CIC PCM values are in the range [-0x4000, 0x4000].
                                                            "3": CIC filter PCM frequency is 1/16 * PDM frequency. CIC PCM values are in the range [-0x8:0000, 0x8:0000].
                                                            "4": CIC filter PCM frequency is 1/32 * PDM frequency. CIC PCM values are in the range [-0x100:0000, 0x100:0000].
                                                            "5"-"7": Illegal values. */
    
