ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_pdm_pcm_v2.h
    cy_en_pdm_pcm_ch_fir0_decimcode_t    fir0_decim_code;/**< FIR filter decimation. The FIR filter PCM frequency is a fraction of the CIC filter PCM frequency:
                                                            "0": FIR 0 filter PCM frequency is 1 * CIC filter PCM frequency.
                                                            "1": FIR 0 filter PCM frequency is 1/2 * CIC filter PCM frequency.
                                                            "2": FIR 0 filter PCM frequency is 1/3 * CIC filter PCM frequency.
                                                            "3": FIR 0 filter PCM frequency is 1/4 * CIC filter PCM frequency.
                                                            "4": FIR 0 filter PCM frequency is 1/5 * CIC filter PCM frequency. */
                                                            
    uint8_t                                fir0_scale;        /**< FIR 0 filter PCM scaling. FIR 0 filter PCM values (fir0_pcm[44:0]) are scaled (right shifted, rounded and clipped)
                                                            to 26-bit signed PCM values (fir0_scaled_pcm[25:0]). These 26-bit PCM values are input to the FIR 1 filter.
                                                            SCALE specifies the right shift amount (and performs a rounding) */
                                                            
    cy_en_pdm_pcm_ch_fir1_decimcode_t    fir1_decim_code;/**< FIR filter decimation. The FIR filter PCM frequency is a fraction of the FIR0 filter PCM frequency:
                                                            "0": FIR 0 filter PCM frequency is 1 * FIR0 filter PCM frequency.
                                                            "1": FIR 0 filter PCM frequency is 1/2 * FIR0 filter PCM frequency.
                                                            "2": FIR 0 filter PCM frequency is 1/3 * FIR0 filter PCM frequency.
                                                            "3": FIR 0 filter PCM frequency is 1/4 * FIR0 filter PCM frequency. */
                                                            
    uint8_t                                fir1_scale;        /**< FIR 1 filter PCM scaling. FIR 1 filter PCM values (fir1_pcm[43:0]) are scaled (right shifted, rounded and clipped)
                                                            to 26-bit signed PCM values (fir1_scaled_pcm[23:0]). These 24-bit PCM values are input to the DC blocker.
                                                            SCALE specifies the right shift amount (and performs a rounding) */
                                                            
    uint8_t                                dc_block_code;    /**< DC blocker coefficient. The DC blocker is defined as:
                                                            "0": alpha = 1 - (1/2^(12-0)) = 0.999755859.
                                                            "1": alpha = 1 - (1/2^(12-1)) = 0.999511719.
                                                            "2": alpha = 1 - (1/2^(12-2)) = 0.999023438.
                                                            "3": alpha = 1 - (1/2^(12-3)) = 0.998046875.
                                                            "4": alpha = 1 - (1/2^(12-4)) = 0.99609375.
                                                            "5": alpha = 1 - (1/2^(12-5)) = 0.9921875.
                                                            "6": alpha = 1 - (1/2^(12-6)) = 0.984375.
                                                            "7": alpha = 1 - (1/2^(12-7)) = 0.96875. */
 } cy_stc_pdm_pcm_channel_config_t;


/** PDM-PCM initialization configuration */
typedef struct
{
    uint8_t                              clkDiv;         /**< PDM Clock Divider
                                                        This configures a frequency of PDM CLK. The configured frequency
                                                        is used to operate PDM core. I.e. the frequency is input to
                                                        MCLKQ_CLOCK_DIV register. */
    cy_en_pdm_pcm_clock_sel_t              clksel;         /**< Interface clock clk_if selection
                                                        "0": SRSS clock clk_if_srss.
                                                        "1": IOSS data input signal "pdm_data[0]".
                                                        "2": IOSS data input signal "pdm_data[1]".
                                                        "3": Clock clk_if is off.*/
    cy_en_pdm_pcm_halve_rate_sel_t      halverate;      /**< Halve rate sampling:
                                                        '0': Full rate sampling. The PDM interface clock pdm_clk is as specified by CLOCK_DIV[]. 
                                                        Each captured PDM value is provided once to the CIC filter.
                                                        '1': Halve rate sampling. The PDM interface clock clk_pdm is as specified by CLOCK_DIV[] divided by two (halve the frequency).
                                                         Each PDM value is captured twice and provided twice to the CIC filter; i.e. the PDM value is repeated.    */
    uint8_t                              route;          /**< Specifies what IOSS data input signal "pdm_data[]" is routed to a specific PDM receiver. 
                                                        Each PDM receiver j has a dedicated     1-bit control field: PDM receiver j uses DATA_SEL[j]. 
                                                        The 1-bit field DATA_SEL[j] specification is as follows:
                                                        '0': PDM receiver j uses data input signal "pdm_data[j]".
                                                        '1': PDM receiver j uses data input signal "pdm_data[j ^ 1]" (the lower bit of the index is inverted). */
    
    
    uint8_t                                fir0_coeff_user_value;    /**< FIR 0 filter coefficient enable (does NOT effect FIR filter scaling and FIR filter decimation):
                                                            '0': Disabled. The middle FIR filter coefficient (16th coefficient, or tap 15 in [0:29] range) is "1" and 
                                                            all other FIR filter coefficients are "0"; i.e. the FIR filter is a pass through filter and the filter gain is "1".
                                                            fir0_pcm[44:0] = cic_pcm[25:0] (with sign extension)'1': Enabled.
                                                            This filter is disabled by default, and typically only used for sample frequencies (Fs) of 8 and 16 kHz. */

    uint8_t                                fir1_coeff_user_value;    /**< FIR 1 filter coefficient enable (does NOT effect FIR filter scaling and FIR filter decimation):
                                                            '0': Disabled. The middle FIR filter coefficient (28th coefficient, or tap 27 in [0:54] range) is "1"
                                                            and all other FIR filter coefficients are "0"; i.e. the FIR filter is a pass through filter
                                                            and the filter gain is "1". fir1_pcm[43:0] = fir0_scaled_pcm[25:0] (with sign extension)'1': Enabled. 
                                                            Disabling of the filter functionality is provided for debug purposes. */

