ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_pdm_pcm_v2.h
    cy_stc_pdm_pcm_fir_coeff_t             fir0_coeff[8];        /**<  The (symmetric) 30-taps finite impulse response (FIR) filter with 14-bit signed coefficients
                                                            (in the range [-8192, 8191]) are specified by FIR0_COEFF0, ..., FIR0_COEFF7.
                                                            The FIR filter coefficients have no default values: 
                                                            the coefficients MUST be programmed BEFORE the filter is enabled.
                                                            By Default FIR0 is disabled and is only used for 8Khz and 16 Khz sample frequencies.*/

    cy_stc_pdm_pcm_fir_coeff_t             fir1_coeff[14];        /**< The (symmetric) 55-taps finite impulse response (FIR) filter 
                                                            with 14-bit signed coefficients (in the range [-8192, 8191])
                                                            are specified by FIR1_COEFF0, ..., FIR1_COEFF13.
                                                            The (default) FIR filter has built in droop correction.
                                                            The filter gain (sum of the coefficients) is 13921 and the default
                                                            coefficients (as specified by FIR1_COEFFx.DATA0/1[13:0]) are:
                                                            -2,   21,   26,  -17,  -41,   25,    68, -33,
                                                            -107,   41,  160,  -48, -230,   54,   325, -56,
                                                            -453,   51,  631,  -31, -894,  -21,  1326, 172,
                                                            -2191, -770, 4859, 8191, 4859, -770, -2191, 172,
                                                            1326,  -21, -894,  -31,  631,   51,  -453, -56,
                                                             325,   54, -230,  -48,  160,   41,  -107, -33,
                                                              68,   25,  -41,  -17,   26,   21,    -2. */
} cy_stc_pdm_pcm_config_v2_t;

/** \cond INTERNAL */
typedef cy_stc_pdm_pcm_config_v2_t cy_stc_pdm_pcm_config_t;
/** \endcond */

/** \} group_pdm_pcm_data_structures_v2 */


/** \cond INTERNAL */
/******************************************************************************
 * Local definitions
*******************************************************************************/
/** Define bit mask for all available interrupt sources */
#define CY_PDM_PCM_INTR_MASK        (CY_PDM_PCM_INTR_RX_TRIGGER           | \
                                     CY_PDM_PCM_INTR_RX_FIR_OVERFLOW     | \
                                     CY_PDM_PCM_INTR_RX_OVERFLOW          | \
                                     CY_PDM_PCM_INTR_RX_IF_OVERFLOW      | \
                                     CY_PDM_PCM_INTR_RX_UNDERFLOW)

/* Non-zero default values */
#define CY_PDM_PCM_CH_IF_CTL_DEFAULT    (0x3U)

#define CY_PDM_PCM_CLK_DIV_MAX 255

#define CY_PDM_PCM_CH_CIC_DECIM_CODE_DEFAULT    (0x4U)
#define CY_PDM_PCM_CH_FIR0_DECIM_CODE_DEFAULT   (0x0U)
#define CY_PDM_PCM_CH_FIR0_SCALE_DEFAULT           (0x0U)
#define CY_PDM_PCM_CH_FIR1_DECIM_CODE_DEFAULT   (0x1U)
#define CY_PDM_PCM_CH_FIR1_SCALE_DEFAULT           (0x0FU)
#define CY_PDM_PCM_CH_FIR1_ENABLE_DEFAULT       (0x1U)
#define CY_PDM_PCM_CH_DCBLOCK_CODE_DEFAULT       (0x1U)
#define CY_PDM_PCM_CH_DCBLOCK_ENABLE_DEFAULT       (0x1U)

#define PDM_TEST_CTL_DRIVE_DELAY_HI_DEFAULT       (0x00U)
#define PDM_TEST_CTL_DRIVE_DELAY_LO_DEFAULT       (0x04U)
#define PDM_TEST_CTL_MODE_HI_DEFAULT               (0x3U)
#define PDM_TEST_CTL_MODE_LO_DEFAULT               (0x3U)
#define PDM_TEST_CTL_AUDIO_FREQ_DIV_DEFAULT       (0x7U)
#define PDM_TEST_CTL_CH_ENABLED_DEFAULT           (0x0U)

#define PDM_CLOCK_CTL_CLOCK_DIV_DEFAULT           (0x07U)
#define PDM_CLOCK_CTL_CLOCK_SEL_DEFAULT           (0x3U)
#define PDM_CLOCK_CTL_HALVE_DEFAULT               (0x0U)


#define CY_PDM_PCM_ENABLE  (0x1U)
#define CY_PDM_PCM_DISABLE (0x0U)



#define CY_PDM_PCM_CH_CTL_WORDSIZE_DEFAULT        (0x0U)
#define CY_PDM_PCM_CH_CTL_WORDSIGN_EXT_DEFAULT  (0x100U)
#define CY_PDM_PCM_CH_CTL_CH_ENABLE_DEFAULT        (0x00000000U)

#define CY_PDM_PCM_TEST_CTL_DEFAULT (_VAL2FLD(PDM_TEST_CTL_DRIVE_DELAY_HI, PDM_TEST_CTL_DRIVE_DELAY_HI_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_DRIVE_DELAY_LO, PDM_TEST_CTL_DRIVE_DELAY_LO_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_MODE_HI, PDM_TEST_CTL_MODE_HI_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_MODE_LO, PDM_TEST_CTL_MODE_LO_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_AUDIO_FREQ_DIV, PDM_TEST_CTL_AUDIO_FREQ_DIV_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_CH_ENABLED, PDM_TEST_CTL_CH_ENABLED_DEFAULT))
                                
#define CY_PDM_PCM_CLK_CTL_DEFAULT (_VAL2FLD(PDM_CLOCK_CTL_CLOCK_DIV, PDM_CLOCK_CTL_CLOCK_DIV_DEFAULT) | \
                                _VAL2FLD(PDM_CLOCK_CTL_CLOCK_SEL, PDM_CLOCK_CTL_CLOCK_SEL_DEFAULT) | \
                                _VAL2FLD(PDM_CLOCK_CTL_HALVE, PDM_CLOCK_CTL_HALVE_DEFAULT))

#define CY_PDM_PCM_CH_CTL_DEFAULT (_VAL2FLD(PDM_CH_CTL_WORD_SIZE, CY_PDM_PCM_CH_CTL_WORDSIZE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_CTL_WORD_SIGN_EXTEND, CY_PDM_PCM_CH_CTL_WORDSIGN_EXT_DEFAULT) | \
                                _VAL2FLD(PDM_CH_CTL_ENABLED, CY_PDM_PCM_CH_CTL_CH_ENABLE_DEFAULT))
                                
#define CY_PDM_PCM_CH_FIR1_DEFAULT (_VAL2FLD(PDM_CH_FIR1_CTL_DECIM2, CY_PDM_PCM_CH_FIR1_DECIM_CODE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_FIR1_CTL_SCALE, CY_PDM_PCM_CH_FIR1_SCALE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_FIR1_CTL_ENABLED, CY_PDM_PCM_CH_FIR1_ENABLE_DEFAULT))
                                
#define CY_PDM_PCM_CH_DCBLOCK_DEFAULT (_VAL2FLD(PDM_CH_DC_BLOCK_CTL_CODE, CY_PDM_PCM_CH_DCBLOCK_CODE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_DC_BLOCK_CTL_ENABLED, CY_PDM_PCM_CH_DCBLOCK_ENABLE_DEFAULT))



